Revit 2027 API
StructuralConnectionHandlerType.ConnectionGuid Property
 The GUID to use for identifying connection geometry generation algorithm.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid ConnectionGuid { get; }
Public ReadOnly Property ConnectionGuid As Guid
	Get
public:
property Guid ConnectionGuid {
	Guid get ();
}
member ConnectionGuid : Guid with get
Property Value
Guid
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace